In [43]:
import pandas as pd

In [44]:
df = pd.read_csv("/Users/zihan/Desktop/ai-job-market-analyzer/notebooks/ds_salaries_cleaned.csv")
df.head()

,unnamed:_0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,UK,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,USA,L

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 607 entries, 0 to 606
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   unnamed:_0          607 non-null    int64
 1   work_year           607 non-null    int64
 2   experience_level    607 non-null    object
 3   employment_type     607 non-null    object
 4   job_title           607 non-null    object
 5   salary              607 non-null    int64
 6   salary_currency     607 non-null    object
 7   salary_in_usd       607 non-null    int64
 8   employee_residence  607 non-null    object
 9   remote_ratio        607 non-null    int64
 10  company_location    607 non-null    object
 11  company_size        607 non-null    object
dtypes: int64(5), object(7)
memory usage: 57.0+ KB

In [46]:
df = df.drop(columns=["unnamed:_0"])

In [47]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [48]:
TARGET = "salary_in_usd"

In [49]:
experience_map = {
    "EN": 0,
    "MI": 1,
    "SE": 2,
    "EX": 3
}

df["experience_level_ord"] = df["experience_level"].map(experience_map)

In [50]:
df[["experience_level", "experience_level_ord"]].drop_duplicates().sort_values("experience_level_ord")

   experience_level  experience_level_ord
5                EN                     0
0                MI                     1
1                SE                     2
25               EX                     3

In [51]:
df["employment_type_cat"] = df["employment_type"]
df["is_full_time"] = (df["employment_type"] == "FT").astype(int)

In [52]:
df[["employment_type", "employment_type_cat", "is_full_time"]].value_counts()

employment_type  employment_type_cat  is_full_time
FT               FT                   1               588
PT               PT                   0                10
CT               CT                   0                 5
FL               FL                   0                 4
Name: count, dtype: int64

In [53]:
df["fully_remote_flag"] = (df["remote_ratio"] == 100).astype(int)

In [54]:
df[["remote_ratio", "fully_remote_flag"]].value_counts().sort_index()

remote_ratio  fully_remote_flag
0             0                    127
50            0                     99
100           1                    381
Name: count, dtype: int64

In [55]:
def map_role(title: str) -> str:
    title = title.lower()

    if "data scientist" in title:
        return "Data Scientist"
    if "data engineer" in title or "big data" in title:
        return "Data Engineer"
    if "machine learning" in title or "ml engineer" in title:
        return "ML Engineer"
    if "data analyst" in title or "bi analyst" in title:
        return "Analyst"
    if "manager" in title:
        return "Manager"
    if "director" in title or "head of" in title:
        return "Director"
    if "research" in title:
        return "Research"
    if "architect" in title:
        return "Architect"
    else:
        return "Other"

df["role_category"] = df["job_title"].apply(map_role)
df["role_category"].value_counts()

role_category
Data Scientist    159
Data Engineer     159
Analyst           119
ML Engineer        68
Other              39
Manager            19
Research           17
Director           16
Architect          11
Name: count, dtype: int64

In [56]:
leadership_keywords = [
    "lead", "principal", "manager", "director", "head", "staff"
]

def has_leadership(title: str) -> int:
    title = title.lower()
    return int(any(keyword in title for keyword in leadership_keywords))

df["leadership_flag"] = df["job_title"].apply(has_leadership)

In [57]:
df[["job_title", "leadership_flag"]].sample(10)

                      job_title  leadership_flag
55     Principal Data Scientist                1
131              Data Scientist                0
526              Data Scientist                0
122                Data Analyst                0
493  Machine Learning Developer                0
516        Data Science Manager                1
492              Data Scientist                0
246              Data Scientist                0
342        Head of Data Science                1
571              Data Scientist                0

In [58]:
company_size_map = {
    "S": 0,
    "M": 1,
    "L": 2
}

df["company_size_ord"] = df["company_size"].map(company_size_map)

In [59]:
df[["company_size", "company_size_ord"]].drop_duplicates()

  company_size  company_size_ord
0            L                 2
1            S                 0
2            M                 1

In [60]:
df["company_country"] = df["company_location"]

In [61]:
df = df.drop(columns=[
    "salary",
    "salary_currency",
    "job_title",
    "employee_residence"
])

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 607 entries, 0 to 606
Data columns (total 15 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   work_year             607 non-null    int64
 1   experience_level      607 non-null    object
 2   employment_type       607 non-null    object
 3   salary_in_usd         607 non-null    int64
 4   remote_ratio          607 non-null    int64
 5   company_location      607 non-null    object
 6   company_size          607 non-null    object
 7   experience_level_ord  607 non-null    int64
 8   employment_type_cat   607 non-null    object
 9   is_full_time          607 non-null    int64
 10  fully_remote_flag     607 non-null    int64
 11  role_category         607 non-null    object
 12  leadership_flag       607 non-null    int64
 13  company_size_ord      607 non-null    int64
 14  company_country       607 non-null    object
dtypes: int64(8), object(7)
memory usage: 71.3+ KB

In [65]:
OUTPUT_PATH = "ds_salaries_features_v1.csv"

df.to_csv(OUTPUT_PATH, index=False)

print("✅ Feature-engineered dataset saved")
print("Path:", OUTPUT_PATH)
print("Columns:")
print(df.columns.tolist())

✅ Feature-engineered dataset saved
Path: ds_salaries_features_v1.csv
Columns:
['work_year', 'experience_level', 'employment_type', 'salary_in_usd', 'remote_ratio', 'company_location', 'company_size', 'experience_level_ord', 'employment_type_cat', 'is_full_time', 'fully_remote_flag', 'role_category', 'leadership_flag', 'company_size_ord', 'company_country']